#0) გაიხსენე რა არის შედარებითი (==, !=, <, >) და ლოგიკური ოპერატორები (and, or, not)
print(5 == 5)      # True - ტოლია
print(5 != 3)      # True - არ არის ტოლი
print(5 > 3)       # True - მეტია
print(5 < 3)       # False - ნაკლებია
print(5 >= 5)      # True - მეტია ან ტოლია
print(5 <= 4)      # False - ნაკლებია ან ტოლია
#1) შექმენი ორი ცვლადი: x = 5 და y = 10. დაბეჭდე x < y და ახსენი რას გამოიტანს
x = 5

y = 10

print(x<y)

#გამოიტანს true-ს

#2) შექმენი ორი ცვლადი: a = 7 და b = 3. დაბეჭდე a > b და ახსენი რას ნიშნავს
a = 7
b = 3
print(a > b)
#გამოიტანს true-ს





#3) შექმენი სამი ცვლადი: ასაკი = 17, აქვს_პირადობა = False, სტუდენტია = True. დაბეჭდე ასაკი >= 18 and აქვს_პირადობა
ასაკი = 17

აქვს_პირადობა = False

print(ასაკი >= 18 and აქვს_პირადობა)

#4) შექმენი ორი ცვლადი: მოსწონს_შოკოლადი = True და ჭამს_ჯანსაღად = False. დაბეჭდე მოსწონს_შოკოლადი or ჭამს_ჯანსაღად
მოსწონს_შოკოლადი = True

ჭამს_ჯანსაღად = False

print(მოსწონს_შოკოლადი or ჭამს_ჯანსაღად)
#5) შექმენი ცვლადი: არის_აქტიური = False. დაბეჭდე not არის_აქტიური და განმარტე რას ნიშნავს შედეგი

არის_აქტიური = False


print(not არის_აქტიური)








