my_list = [10, 20, 30, 40, 50, 60, 70, 80, 90, 100]


print("პირველი ელემენტი:", my_list[0])


print("ბოლო ელემენტი:", my_list[-1])















# [:] -> მთლიანი სია
# [start:] -> start-დან ბოლომდე
# [:end] -> თავიდან end-მდე
# [start:end] -> დიაპაზონი
# [::step] -> ნაბიჯებით სია
# [::-1] -> უკუღმა სია
# [start:end:step] -> კომბინაცია
# უარყოფითი ინდექსები: [-1], [-2:], :-3] ...


nums = [2, 4, 6, 8, 10, 12, 14, 16, 18]


print("პირველი ოთხი:", nums[:4])    # [2, 4, 6, 8]

print("შუა ოთხი:", nums[2:6])      # [6, 8, 10, 12]

print("უკუღმა ყოველ მეორე:", nums[::-2])  # [18, 14, 10, 6, 2]