
#0) ახსენი ერთ წინადადაში რას აკეთებს while loop და როდის ჩერდება


#while loop ასრულებს კოდს მანამ, სანამ მოცემული პირობა ჭეშმარიტია და ჩერდება, როცა ეს პირობა გახდება მცდარი

#1) დაწერე while loop, რომელიც ბეჭდავს რიცხვებს 0-დან 4-მდე

i = 0
while i < 5:
    print(i)
    i += 1

#2) დაწერე while loop, რომელიც ბეჭდავს "გამარჯობა" სანამ counter ცვლადი ნაკლებია 3-ზე


counter = 0
while counter < 3:
    print("გამარჯობა")
    counter += 1


#3) დაწერე while loop, რომელიც თვლის 1-იდან 5-მდე და როცა რიცხვი ტოლია 3-ს — დაბეჭდავს "საშუალო"

i = 1
while i <= 5:
    if i == 3:
        print("საშუალო")
    i += 1

#4) დაწერე while loop, რომელიც თვლის 1-იდან 5-მდე და დაბეჭდავს მხოლოდ მაშინ როცა რიცხვი მეტია 2-ზე

i = 1
while i <= 5:
    if i > 2:
        print(i)
    i += 1


#5) დაწერე while loop, რომელიც ამთავრებს მუშაობას (break) თუ counter ცვლადი უდრის 4-ს

counter = 0
while True:
    if counter == 4:
        break
    print(counter)
    counter += 1