# 0) Default value ნიშნავს მნიშვნელობას, რომელიც პარამეტრს ავტომატურად ენიჭება,
# თუ ფუნქცია გამოძახებისას ამ პარამეტრს არ მივაწოდებთ.

# 1) ფუნქცია, რომელიც ბეჭდავს სახელით მისალმებას
def greet(name="მეგობარო"):
    print(f"გამარჯობა, {name}!")


# 2) ფუნქცია, რომელიც აბრუნებს ორი რიცხვის ნამრავლს
def multiply(a, b=2):
    return f"რიცხვების ნამრავლი არის {a * b}"


# 3) ფუნქცია, რომელიც ბეჭდავს მისალმებას ქვეყნის მიხედვით
def welcome(country="საქართველო"):
    print(f"კეთილი იყოს თქვენი მობრძანება {country}-ში!")


# 4) ფუნქცია, რომელიც აბრუნებს base-ის exp ხარისხში აღმავლობას
def power(base, exp=3):
    return base ** exp


# 5) ფუნქცია, რომელიც ბეჭდავს სახელს და ასაკს
def info(name, age=18):
    print(f"სახელი: {name}, ასაკი: {age}")
